## Class exercises:

Make a function that:

1. Create a **data frame** with this:

In [0]:
# comment
names=["Tomás", "Pauline", "Pablo", "Bjork","Alan","Juana"]

woman=[False,True,False,False,False,True]

ages=[32,33,28,30,32,27]

country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]

education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

In [0]:
[x for x in zip(names,ages)]

[('Tomás', 32),
 ('Pauline', 33),
 ('Pablo', 28),
 ('Bjork', 30),
 ('Alan', 32),
 ('Juana', 27)]

In [0]:
data={'names':names, 'ages':ages, 'woman':woman,'country':country, 'education':education}

In [0]:
data

{'names': ['Tomás', 'Pauline', 'Pablo', 'Bjork', 'Alan', 'Juana'],
 'ages': [32, 33, 28, 30, 32, 27],
 'woman': [False, True, False, False, False, True],
 'country': ['Chile', 'Senegal', 'Spain', 'Norway', 'Peru', 'Peru'],
 'education': ['Bach', 'Bach', 'Master', 'PhD', 'Bach', 'Master']}

In [0]:
# now in a dict:
import pandas

friends=pandas.DataFrame(data)
# seeing it:
friends

     names  ages  woman  country education
0    Tomás    32  False    Chile      Bach
1  Pauline    33   True  Senegal      Bach
2    Pablo    28  False    Spain    Master
3    Bjork    30  False   Norway       PhD
4     Alan    32  False     Peru      Bach
5    Juana    27   True     Peru    Master

In [0]:
type(friends)

pandas.core.frame.DataFrame

* subsetting
* control of execution

In [0]:
oldFriends=friends[friends.ages>30]

In [0]:
friends

     names  ages  woman  country education
0    Tomás    32  False    Chile      Bach
1  Pauline    33   True  Senegal      Bach
2    Pablo    28  False    Spain    Master
3    Bjork    30  False   Norway       PhD
4     Alan    32  False     Peru      Bach
5    Juana    27   True     Peru    Master

In [0]:
oldFriends

     names  ages  woman  country education
0    Tomás    32  False    Chile      Bach
1  Pauline    33   True  Senegal      Bach
4     Alan    32  False     Peru      Bach

In [0]:
[x for x in friends.ages]

[32, 33, 28, 30, 32, 27]

In [0]:
[x*2 for x in friends.ages]

[64, 66, 56, 60, 64, 54]

In [0]:
list(zip(friends.ages,friends.education))

[(32, 'Bach'),
 (33, 'Bach'),
 (28, 'Master'),
 (30, 'PhD'),
 (32, 'Bach'),
 (27, 'Master')]

In [0]:
[x[1] for x in zip(friends.ages,friends.education)]

['Bach', 'Bach', 'Master', 'PhD', 'Bach', 'Master']

In [0]:
xldf=pandas.read_excel("testExcel.xlsx")

In [0]:
xldf

   name   age     city
0   Jim  11.0  Seattle
1  Mary   NaN  Orlando
2  John  33.0      NaN

2. Create a list of tuples, where each tuple is a pair (name,country), using comprehensions

In [0]:
[(n,c) for n,c in zip(friends.names,friends.country)]

[('Tomás', 'Chile'),
 ('Pauline', 'Senegal'),
 ('Pablo', 'Spain'),
 ('Bjork', 'Norway'),
 ('Alan', 'Peru'),
 ('Juana', 'Peru')]

3. Implement a _for_ loop to count how many peruvian there are in the data frame.

In [0]:
counterOfPeruvian=0 # counter 

for x in friends.country:
    print('i got', x)
    if x=='Peru':
        print('found one', x)
        counterOfPeruvian +=1 #updating counter
    
    else:
        print('nope', x)
        
    print('so far', counterOfPeruvian, ' peruvians')

# to see the results:
#counterOfPeruvian

i got Chile
nope Chile
so far 0  peruvians
i got Senegal
nope Senegal
so far 0  peruvians
i got Spain
nope Spain
so far 0  peruvians
i got Norway
nope Norway
so far 0  peruvians
i got Peru
found one Peru
so far 1  peruvians
i got Peru
found one Peru
so far 2  peruvians

In [0]:
len(friends[friends.country=='Peru'])

2

In [0]:
friends[friends.country=='Peru'].shape[0]

2

In [0]:
friends.where(friends.country=='Peru').dropna().shape[0]

4. Implement a _for_ loop to get the count of men. Try using **not** in one solution and **~** in another one.

In [0]:
counterOfMen=0 # counter 

for woman in friends.woman:
    if woman==False:
        counterOfMen +=1 #updating counter

# to see the results:
counterOfMen

In [0]:
counterOfMen=0 # counter 

for woman in friends.woman:
    if not woman:
        counterOfMen +=1 #updating counter

# to see the results:
counterOfMen

In [0]:
counterOfMen=0 # counter 

for man in ~friends.woman:
    if man:
        counterOfMen +=1 #updating counter

# to see the results:
counterOfMen

In [0]:
list(zip(friends.woman,~friends.woman))

[(False, True),
 (True, False),
 (False, True),
 (False, True),
 (False, True),
 (True, False)]

## Homework

1. Implement a _for_ loop to get the count of men that have a Bach degree in the data frame. I recommend the use of **zip** (somwehere)

In [0]:
counterOfMenBach=0 # counter 
for value in zip(friends.woman,friends.education): 
    if (value[0]==False) & (value[1]=='Bach'):
        counterOfMenBach +=1 #updating counter
# to see the results:
counterOfMenBach

2

In [0]:
counterOfMenBach=0 # counter 

for value in zip(~friends.woman,friends.education): 
    if (value[0]==True) & (value[1]=='Bach'):
        counterOfMenBach +=1 #updating counter
# to see the results:
counterOfMenBach

2

In [0]:
counterOfMenBach=0 # counter 

for value in zip(~friends.woman,friends.education):
    
    if (value[0]) & (value[1]=='Bach'):
        
        counterOfMenBach +=1 #updating counter

# to see the results:
counterOfMenBach

2

In [0]:
counterOfMenBach=0 # counter 

for x,y in zip(~friends.woman,friends.education):

    if x and y=='Bach':

        counterOfMenBach +=1 #updating counter

# to see the results:
counterOfMenBach

2

2. Implement a _for_ loop to get the count of people whose current age is an even number.

In [0]:
counterOfEven=0 # counter 

for age in friends.ages:
    if age%2!=0:
        
        counterOfEven +=1 #updating counter

# to see the results:
counterOfEven

2